//
//  main.swift
//  Swift-Lesson-2
//
//  Created by Andrei on 10/23/18.
//  Copyright © 2018 Andrei Savchenko. All rights reserved.
//
//Створіть такі класи - двигун, автомобіль, дисплей

//Автомобіль - класс через який користувач взаємодіє з двигуном (може керувати швидкістю, включати/включати двигун).
//Також автомобіль містить інфу про його модель та виводить поточний стан на Дисплей

//Двигун - класс який безпосередньо крутить колеса, керує гальмом. В нього є максимальна швидкість і стан вкл/викл

//Дисплей - це класс який ТІЛЬКИ показує статус автомобіля і двигуна (швидкість, обороти і т. п. )
import Foundation

var car = Car()
car.viewDisplay()
